backend/controllers/CategoryController.php

    public function actionDelete($id)
    {

        $model = Category::findOne($id);
        $model_child =Category::findOne(['parent_id'=>$id]);
---
SELECT * FROM `category` WHERE `id`='13'