frontend/controllers/SiteController.php

SELECT * FROM `contact` ORDER BY `id` DESC
SELECT * FROM `news` WHERE `status`=10 ORDER BY `updated_at` DESC LIMIT 4
---
    public function actionContact()
    {
        $contact = Contact::find()->orderBy(['id'=>SORT_DESC])->one();
        $related_post = News::find()
            ->andWhere(['status' => Category::STATUS_ACTIVE])
            ->orderBy(['updated_at'=>SORT_DESC])
            ->limit(4)
            ->all();

SELECT * FROM `category` WHERE `id`='11'
SELECT COUNT(*) FROM `news` WHERE (`status`=10) AND (`category_id`='11')
SELECT * FROM `news` WHERE (`status`=10) AND (`category_id`='1') ORDER BY `id` DESC
---
    public function actionListCategory()
    {
        $listCats = Category::findAll(['status' => Category::STATUS_ACTIVE]);
        $listNews = News::find()->andWhere(['status' => Category::STATUS_ACTIVE]);
        $countQuery = clone $listNews;
        $pages = new Pagination(['totalCount' => $countQuery->count()]);
        $pageSize = Yii::$app->params['page_size'];
        $pages->setPageSize($pageSize);
        $models = $listNews->offset($pages->offset)
            ->limit(10)->all();

SELECT * FROM `news` WHERE `id`='1'
---
    public function actionDetailNews($id)
    {
        $new = News::findOne($id);

SELECT * FROM `news` WHERE (`status`=10) AND (`category_id` <> 1) LIMIT 4
---
    public function actionDetailSolution($id)
    {
        $new = HomeSolution::findOne($id);
        if (!$new) {
            return $this->redirect(['site/index']);
        }
        $related_post = News::find()
            ->andWhere(['status' => Category::STATUS_ACTIVE])
            ->limit(4)
            ->all();