common/models/Category.php

SELECT * FROM `category` WHERE `parent_id`=1
---
    public static function getAllChildCats($parent = null)
    {
        if ($parent === null) {
            return [];
        }

        static $listCat = [];

        $cats = self::findAll(['parent_id' => $parent]);

SELECT * FROM `category` WHERE `id`=9
SELECT * FROM `category` WHERE `parent_id` IS NULL ORDER BY `id` DESC
---
    public static function getAllCategories($cat_id = null, $recursive = true)
    {
        $res = [];
        if ($cat_id != null) {
            $model = Category::findOne(['id' => $cat_id]);

            if ($model === null) {
                throw new NotFoundHttpException(404, "The requested Vod Category (#$cat_id) does not exist.");
            }

            //Thuc: them 'order'=>'order_number ASC' trong ham relations
            $children = $model->getBECategories();

            if ($children) {
                foreach ($children as $child) {
                    /** @var  $child Category */
                    $path = "";
                    $path .= Category::CHILD_NODE_PREFIX;
                    $child->display_name = $path . $child->display_name;
//                    $child->id = $path . $child->display_name;
                    $res[] = $child;
                    if ($recursive) {
                        $res = ArrayHelper::merge($res,
                            Category::getAllCategories($child->id));
                    }
                }
            }
        } else {
            $root_cats = Category::find()->andWhere(['parent_id' => null])
                ->orderBy(['id' => SORT_DESC])->all();

SELECT * FROM `category` WHERE `parent_id`=9 ORDER BY `id` DESC
---
    public function getBECategories()
    {
        return $this->hasMany(Category::className(), ['parent_id' => 'id'])
            ->orderBy(['id' => SORT_DESC])->all();