common/models/News.php

    public function getNameCategory()
    {
        $category = Category::findOne($this->category_id);
---
SELECT * FROM `category` WHERE `id`=1

    public function getAuthorPoster()
    {
        $author = User::findOne($this->posted_id);
---
SELECT * FROM `user` WHERE `id` IS NULL