common/models/User.php

SELECT * FROM `user` WHERE (`username`='admin') AND (`status`=10) AND (`type`=1)
---
    public static function findAdminByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE, 'type' => self::USER_TYPE_ADMIN]);