backend/models/LoginForm.php

SELECT * FROM `user` WHERE (`username`='admin') AND (`type`=1)
---
    public function validateUser($attribute, $params)
    {
        if (!$this->hasErrors()) {
            /** @var  $user User*/
            $user = User::findOne(['username' => $this->username,'type' => User::USER_TYPE_ADMIN]);