frontend/widgets/FooterWidget.php

SELECT * FROM `category` WHERE `status`=10 LIMIT 6
---
    public function run()
    {
        $category = Category::find()->andWhere(['status'=>Category::STATUS_ACTIVE])->limit(6)->all();