frontend/widgets/HeaderWidget.php

SELECT * FROM `category` WHERE (`status`=10) AND (parent_id is null)
---
    public function run()
    {
        $this->parentCategory = Category::find()->andWhere(['status'=>Category::STATUS_ACTIVE])->andWhere('parent_id is null')->all();