frontend/widgets/MenuWidget.php

SELECT * FROM `category` WHERE `status`=10
---
    public function run()
    {
        $listCat = Category::find()
            ->andWhere(['status'=>Category::STATUS_ACTIVE])
            ->all();