backend/views/category/index.php

SELECT * FROM `category` WHERE `id`=3
---
                                 * @var $model Category
                                 */
                                if($model->parent_id){
                                    return Category::findOne($model->parent_id)->display_name;